// Uuencoder.cpp : インプリメンテーション ファイル
//

#include "stdafx.h"
#include "Uuencoder.h"

#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif

/////////////////////////////////////////////////////////////////////////////
// CUuencoder 定義

#define ENC(ch) (m_pTrans[(ch) & 077])

/////////////////////////////////////////////////////////////////////////////
// CUuencoder 定数

const char uu_std[64] =
{
  '`', '!', '"', '#', '$', '%', '&', '\'',
  '(', ')', '*', '+', ',', '-', '.', '/',
  '0', '1', '2', '3', '4', '5', '6', '7',
  '8', '9', ':', ';', '<', '=', '>', '?',
  '@', 'A', 'B', 'C', 'D', 'E', 'F', 'G',
  'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O',
  'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W',
  'X', 'Y', 'Z', '[', '\\', ']', '^', '_'
};

/////////////////////////////////////////////////////////////////////////////
// CUuencoder クラスの構築/消滅

/*[2]-----------------------------------------------------------------------------[2]*/
/*|	概要	：コンストラクタ														|*/
/*|	解説	：																		|*/
/*|	備考	：																		|*/
/*|	履歴	：																		|*/
/*|	I/F		：																		|*/
/*[0]-----------------------------------------------------------------------------[0]*/
CUuencoder::CUuencoder()
{
	//変換テーブルポインタセット
	m_pTrans = (char*)uu_std;		/* Standard encoding is old uu format.  */
}

/*[2]-----------------------------------------------------------------------------[2]*/
/*|	概要	：デストラクタ															|*/
/*|	解説	：																		|*/
/*|	備考	：																		|*/
/*|	履歴	：																		|*/
/*|	I/F		：																		|*/
/*[0]-----------------------------------------------------------------------------[0]*/
CUuencoder::~CUuencoder()
{
}

/////////////////////////////////////////////////////////////////////////////
// CUuencoder パブリック関数

/*[2]-----------------------------------------------------------------------------[2]*/
/*|	概要	：バイト列のＵＵＥＮＣＯＤＥ											|*/
/*|	解説	：																		|*/
/*|	備考	：																		|*/
/*|	履歴	：																		|*/
/*|	I/F		：																		|*/
/*[0]-----------------------------------------------------------------------------[0]*/
CString CUuencoder::BytesEncode
	(	LPBYTE	lpbyBufIn,
		UINT	nLen
	)
{
	int ch=0, n=0;
	BYTE *p=NULL;
	CString	objStr=_T("");

	n = (int)nLen;
	objStr += ENC(n);

	for(p=lpbyBufIn; n>2; n-=3, p+=3)
	{
		ch = *p >> 2;
		ch = ENC (ch);
		objStr += (UCHAR)ch;

		ch = ((*p << 4) & 060) | ((p[1] >> 4) & 017);
		ch = ENC(ch);
		objStr += (UCHAR)ch;

		ch = ((p[1] << 2) & 074) | ((p[2] >> 6) & 03);
		ch = ENC (ch);
		objStr += (UCHAR)ch;

		ch = p[2] & 077;
		ch = ENC (ch);
		objStr += (UCHAR)ch;
	}

	if(n != 0)
    {
		BYTE c1 = *p;
		BYTE c2 = n == 1 ? 0 : p[1];

		ch = c1 >> 2;
		ch = ENC (ch);
		objStr += (UCHAR)ch;

		ch = ((c1 << 4) & 060) | ((c2 >> 4) & 017);
		ch = ENC (ch);
		objStr += (UCHAR)ch;

		if (n == 1)
			ch = ENC ('\0');
		else
		{
			ch = (c2 << 2) & 074;
			ch = ENC (ch);
		}
		objStr += (UCHAR)ch;

		ch = ENC ('\0');
		objStr += (UCHAR)ch;
    }

	//変換後文字列を返す
	return objStr;
}

